Repository: CofficLab/GitOK
Catalog: Plugins/GitWorkspacePlugin/Sources/GitWorkspace/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Commit
zh_hans: 提交
zh_hk: 提交

source: Git commit management
zh_hans: Git 提交管理
zh_hk: Git 提交管理

# Git 用户名
source: Git Username
zh_hans: Git 用户名
zh_hk: Git 用户名

# GitOK 会通过当前 Git credential helper 保存凭据；GitHub/GitLab 等平台通常需要 token。
source: GitOK saves credentials via the current Git credential helper; platforms like GitHub/GitLab usually require a token.
zh_hans: GitOK 会通过当前 Git credential helper 保存凭据；GitHub/GitLab 等平台通常需要 token。
zh_hk: GitOK 會透過目前 Git credential helper 儲存憑證；GitHub/GitLab 等平台通常需要 token。

source: Hard Reset
zh_hans: 硬重置
zh_hk: 硬重置

source: Mixed Reset
zh_hans: 混合重置
zh_hk: 混合重置

# Personal Access Token 或密码
source: Personal Access Token or Password
zh_hans: Personal Access Token 或密码
zh_hk: Personal Access Token 或密碼

source: Revert
zh_hans: 还原
zh_hk: 還原

source: Soft Reset
zh_hans: 软重置
zh_hk: 軟重置

source: Squash
zh_hans: 压缩
zh_hk: 壓縮

source: User info not found
zh_hans: 未找到用户信息
zh_hk: 未找到使用者資訊

# 丢弃
source: Discard
zh_hans: 丢弃
zh_hk: 丢弃

# 为 %@ 添加您的 Git 认证信息
source: Add your Git credentials for %@
zh_hans: 为 %@ 添加您的 Git 认证信息
zh_hk: 为 %@ 添加您的 Git 认证信息

# 保存失败
source: Save Failed
zh_hans: 保存失败
zh_hk: 保存失败

# 保存成功
source: Saved Successfully
zh_hans: 保存成功
zh_hk: 保存成功

# 凭据已安全保存到 macOS Keychain
source: Credentials securely saved to macOS Keychain
zh_hans: 凭据已安全保存到 macOS Keychain
zh_hk: 憑證已安全儲存到 macOS Keychain

# 加载失败
source: Load Failed
zh_hans: 加载失败
zh_hk: 加载失败

# 取消
source: Cancel
zh_hans: 取消
zh_hk: 取消

# 取消选择
source: Deselect
zh_hans: 取消选择
zh_hk: 取消选择

# 取消选择 %@
source: Deselect %@
zh_hans: 取消选择 %@
zh_hk: 取消选择 %@

# 复制到剪贴板
source: Copy to Clipboard
zh_hans: 复制到剪贴板
zh_hk: 复制到剪贴板

# 复制完整 Hash
source: Copy Full Hash
zh_hans: 复制完整 Hash
zh_hk: 复制完整 Hash

# 已复制
source: Copied
zh_hans: 已复制
zh_hk: 已複製

# 按回车或点击查看差异。打开上下文菜单可暂存、取消暂存、复制路径或丢弃更改。
source: Press Return or click to view the diff. Open the context menu to stage, unstage, copy path, or discard changes.
zh_hans: 按回车或点击查看差异。打开上下文菜单可暂存、取消暂存、复制路径或丢弃更改。
zh_hk: 按回车或点击查看差异。打开上下文菜单可暂存、取消暂存、复制路径或丢弃更改。

# 提交 Hash 详情
source: Commit Hash Details
zh_hans: 提交 Hash 详情
zh_hk: 提交 Hash 詳情

# 提交时间详情
source: Commit Time Details
zh_hans: 提交时间详情
zh_hk: 提交时间详情

# 插入 %@ %@
source: 插入 %1$@ %2$@
zh_hans: 插入 %@ %@
zh_hk: 插入 %@ %@

# 显示提交图
source: Show Commit Graph
zh_hans: 显示提交图
zh_hk: 显示提交图

# 未配置用户信息
source: User Information Not Configured
zh_hans: 未配置用户信息
zh_hk: 未配置用户信息

# 正在加载
source: Loading
zh_hans: 正在加载
zh_hk: 正在加载

# 添加 Git 凭据
source: Add Git Credentials
zh_hans: 添加 Git 凭据
zh_hk: 添加 Git 凭据

# 点击查看完整 Hash 信息
source: Click to view full hash information
zh_hans: 点击查看完整 Hash 信息
zh_hk: 点击查看完整 Hash 信息

# 点击查看完整时间信息
source: Click to view full time information
zh_hans: 点击查看完整时间信息
zh_hk: 点击查看完整时间信息

# 用于批量暂存、取消暂存或丢弃
source: For batch staging, unstaging, or discarding
zh_hans: 用于批量暂存、取消暂存或丢弃
zh_hk: 用于批量暂存、取消暂存或丢弃

# 确定
source: OK
zh_hans: 确定
zh_hk: 确定

# 确认丢弃更改
source: Confirm Discard Changes
zh_hans: 确认丢弃更改
zh_hk: 确认丢弃更改

# 管理预设...
source: Manage Presets...
zh_hans: 管理预设...
zh_hk: 管理预设...

# 选择 %@
source: Select %@
zh_hans: 选择 %@
zh_hk: 選取 %@

# 选择文件
source: Select Files
zh_hans: 选择文件
zh_hk: 选择文件
